OpenFOAM/src/simpleFoam/system/createPatchDict
FoamFile
{
	version	2.0;
	format	ascii;
	class		dictionary;
	object		createPatchDict;
}

pointSync	false;
patches
(
);