OpenFOAM/src/simpleFoam/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 14.855;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    cyl_side
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }
    no_dim
    {
        type            empty;
    }
}