OpenFOAM/src/simpleFoam/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 440.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    cyl_side
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    no_dim
    {
        type            empty;
    }
}