OpenFOAM/src/simpleFoam/system/surfaceFeatureExtractDict
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	object	surfaceFeatureExtractDict;
}

cyl.stl
{
	extractionMethod	extractFromSurface;
	extractFromSurfaceCoeffs
	{
		includedAngle	150;
	}

	writeObj	no;
}